; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared5 - mode
	thermograph3 - mode
	thermograph6 - mode
	thermograph2 - mode
	thermograph7 - mode
	infrared1 - mode
	image4 - mode
	image0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star6 - direction
	Star5 - direction
	Star3 - direction
	Star4 - direction
	Star0 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared1)
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 thermograph7)
	(supports instrument1 image0)
	(supports instrument1 image4)
	(supports instrument1 thermograph6)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(have_image Star7 thermograph6)
	(have_image Star7 image0)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 image4)
	(have_image Planet9 thermograph6)
	(have_image Phenomenon10 thermograph2)
	(have_image Phenomenon10 thermograph3)
	(have_image Star11 thermograph2)
))

)

; plan
1. (turn_to satellite1 star0 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star0)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 star7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star7)
   goals met: 0 of 8
5. (take_image satellite1 star7 instrument1 thermograph6)
   added: (have_image star7 thermograph6)
   goals met: 1 of 8
6. (take_image satellite1 star7 instrument1 image0)
   added: (have_image star7 image0)
   goals met: 2 of 8
7. (turn_to satellite1 planet9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet9)
   goals met: 2 of 8
8. (turn_to satellite0 star3 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star3)
   goals met: 2 of 8
9. (take_image satellite1 planet9 instrument1 thermograph6)
   added: (have_image planet9 thermograph6)
   goals met: 3 of 8
10. (take_image satellite1 planet9 instrument1 image4)
   added: (have_image planet9 image4)
   goals met: 4 of 8
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 8
12. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 4 of 8
13. (turn_to satellite0 phenomenon10 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 8
14. (take_image satellite0 phenomenon10 instrument0 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 5 of 8
15. (turn_to satellite0 phenomenon8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 8
16. (take_image satellite0 phenomenon8 instrument0 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 6 of 8
17. (turn_to satellite0 star11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star11)
   goals met: 6 of 8
18. (take_image satellite0 star11 instrument0 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 7 of 8
19. (turn_to satellite1 phenomenon10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon10)
   goals met: 7 of 8
20. (take_image satellite1 phenomenon10 instrument1 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 8 of 8
